In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [46]:
#convert to ascii to get rid of the special characters
df = pd.read_excel('data/sample_data.xlsx', encoding="ascii")

In [47]:
df.columns

Index(['customer_id', 'gender', 'age', 'total_score', 'industry', 'title',
       'skills'],
      dtype='object')

In [48]:
df.head()

,customer_id,gender,age,total_score,industry,title,skills
0,1,NaN,NaN,3.45,Information Technology and Services,NaN,NaN
1,2,NaN,NaN,3.44,Internet,NaN,NaN
2,3,NaN,0-0,10.49,NaN,NaN,NaN
3,4,Male,0-0,3.46,Construction,"Functional Architect, Business Technology","SharePoint,Management ,Business Intelligence ,..."
4,5,NaN,NaN,3.45,NaN,NaN,NaN

In [49]:
df.describe()

       customer_id  total_score
count  5022.000000  5022.000000
mean   2511.500000     5.853035
std    1449.870856     3.336261
min       1.000000     0.450000
25%    1256.250000     3.430000
50%    2511.500000     3.470000
75%    3766.750000    10.460000
max    5022.000000    10.940000

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5022 entries, 0 to 5021
Data columns (total 7 columns):
customer_id    5022 non-null int64
gender         757 non-null object
age            3009 non-null object
total_score    5022 non-null float64
industry       4148 non-null object
title          2593 non-null object
skills         2366 non-null object
dtypes: float64(1), int64(1), object(5)
memory usage: 274.7+ KB

In [51]:
total_obs = print(df.shape)

(5022, 7)

In [52]:
#check each variable for missing values
print("Total NA:", sum(df.age.isnull().values.ravel()))
print("NA %:", "{:.1%}".format(sum(df.age.isnull().values.ravel())/sum(df.isnull().values.ravel())))

Total NA: 2013
NA %: 16.5%

In [26]:
print("Total NA:", sum(df.gender.isnull().values.ravel()))
print("NA %:", "{:.1%}".format(sum(df.gender.isnull().values.ravel())/sum(df.isnull().values.ravel())))

Total NA: 4265
NA %: 34.9%

In [27]:
print("Total NA:", sum(df.industry.isnull().values))
print("NA %:", "{:.1%}".format(sum(df.industry.isnull().values.ravel())/sum(df.isnull().values.ravel())))

Total NA: 874
NA %: 7.1%

In [28]:
print("Total NA:", sum(df.title.isnull().values))
print("NA %:", "{:.1%}".format(sum(df.title.isnull().values.ravel())/sum(df.isnull().values.ravel())))

Total NA: 2429
NA %: 19.8%

In [29]:
print("Total NA:", sum(df.skills.isnull().values))
print("NA %:", "{:.1%}".format(sum(df.skills.isnull().values.ravel())/sum(df.isnull().values.ravel())))

Total NA: 2656
NA %: 21.7%

In [42]:
#remove '_x000D' and '_x000D_' from the beginning of the values

In [68]:
#break industry into separate columns
for i in range(df['industry'].count()):

range(0, 4148)

In [ ]:
#break title into separate columns

In [ ]:
#break skills into separate columns